<template>
    <div class="p-8 flex justify-center gap-8">
        <div class="max-w-prose flex flex-col md:flex-row md:space-x-8">
            <div class="prose lg:prose-xl">
                <h1 class="text-3xl font-bold mb-4">О нас</h1>

                <div class="prose lg:prose-xl mb-6">
                    <p class="font-semibold">
                        Главная О нас Основание кондитерской фабрики «Красный Октябрь» уходит своими корнями в конец
                        40-х - начало 50-х гг. XIX века.
                    </p>

                    <p>
                        В 1846 году прусско-подданный, Фердинанд Теодор Эйнем прибывает в Москву. 6 декабря 1849 года
                        кондитер «имел счастье поставлять» изделия своего мастерства к столу членов императорской семьи,
                        и за те изделия удостоился высочайшего одобрения Императрицы и Великих Княгинь.
                    </p>

                    <p>
                        В 1851 г. он открывает небольшую лавку по производству пиленого сахара и шоколада на Арбате. К
                        концу 60-ых годов фирма «Эйнем» уже известна на кондитерском рынке России, ее обороты быстро
                        растут и появляется необходимость в постройке большой фабрики.
                    </p>

                    <p>
                        В 1867г. открывается фабрика на Софийской набережной, прямо напротив Кремля. В это время на
                        фабрике работает всего 20 рабочих. В 1870г. строится трехэтажная фабрика по производству
                        бисквита на Берсеневской набережной, а с 1889г. начинает активно осваиваться территория на
                        Болотном острове.
                    </p>

                    <p>
                        С 1869г. Ф. Т. Эйнем приглашает в качестве компаньона Юлиуса Гейса, который выкупает 20% акций
                        предприятия, а после смерти Эйнема в 1876г. становится владельцем фирмы. Предприятие Эйнема к
                        этому времени имело две фабрики в Москве: (на Софийской и Берсеневской набережных), цех по
                        производству фруктовых соков, компотов в Симферополе, три магазина на центральных улицах Москвы.
                        Оборот предприятия в 1876г. достигал уже 600 000 рублей.
                    </p>

                    <p>
                        В 1886г. Ю. Гейс создает акционерное общество «Товарищество паровой фабрики шоколада, конфет и
                        чайных печений Эйнем». Оборот фирмы быстро увеличивается и к 1914г. достигает 7 800 000 рублей.
                        Общее число рабочих и служащих - 2 800 человек. Все производство на фабриках оборудовано по
                        самым новейшим технологиям того времени с идеальнейшим соблюдением гигиены и чистоты. Снабжая
                        своими изделиями огромную Россию, фирма Эйнем располагает шестью элегантно обставленными
                        магазинами, пользующихся большой популярностью в столице и ее окрестностях.
                    </p>

                    <p>
                        На Всероссийской Выставке в 1896г. (Нижний Новгород) «Товарищество Эйнем» удостоилось
                        Государственного Герба, а на Всемирной Выставке в Париже в 1900 году - двух «Grand-Prix». В 1913
                        году «Товарищество Эйнем» было удостоено чести стать поставщиком Двора Его Императорского
                        Величества.
                    </p>

                    <p>
                        15 ноября 1918г. фабрика была национализирована и получила название «Государственная
                        кондитерская фабрика №1». 13 июля 1922г. общее собрание трудового коллектива фабрики постановило
                        переименовать Государственную фабрику №1 (быв.Эйнем) в фабрику «Красный Октябрь». С 1922 г. до
                        31 мая 1934г. фабрика находилась в ведение МСНХ (Московский Совет Народного хозяйства при
                        московско-областном торговом отделе «Моссельпром»).
                    </p>
                </div>
            </div>
        </div>
        <div class="flex flex-col justify-center gap-10">
            <img :src="'red-october-1.jpg'" alt="krasniy-oktyabr" class="rounded-lg shadow-lg w-96" />
            <img :src="'einem.jpg'" alt="krasniy-oktyabr" class="rounded-lg shadow-lg w-96" />
            <img :src="'red-october-2.jpg'" alt="krasniy-oktyabr" class="rounded-lg shadow-lg w-96" />
        </div>
    </div>
</template>
